package com.lst.comadep.utils;

public class StringPackage {
    String[] firstNameList = {"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜",

            "戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐",

            "费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄",

            "和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁",};
    String[] secondNameListMen = {
            "炳","式","强","懋","佳","振","远","思","坤","冰","峻","泓","二",
            "燃","露","枝","晓","依","燃","芝","若","睿","进","若","进","经",
            "富","乃","睿","致","长","家","治","青","科","树","长","清","铖",
            "树","方","晨","自","培","昱","亚","紫","方","季","之","家","泽",
            "晓","孝","知","泽","孝","燃","亚","香","莺","杭","河","炳","冠",
            "汉","炳","俊","默","兴","慧","泽","庆","彬","僖","鸿","宇","广",
            "琪","斌","思","源","靖","东","宜","欣","宜","蔷","建","强","屿",
            "玉","虞","金","羽","宇","羽","慕","口","源" };
    String[] secondNameListWomen = {
            "引","燕","昕","哓","锦","卓","诗","蓉","馨","蓉","坛","秀","京",
            "荣","灵","钧","骏","竣","均","珍","幼","蓉","郡","俊","燕","亚",
            "榆","勇","鲁","正","青","殿","怡","清","霞","宝","筱","莹","悦",
            "怡","秀","霞","村","秀","绣","键","霞","莉","玲","玲","瑞","艺",
            "村","纯","昕","明","玉","春","曼","伊","颖","怡","江","琳","文",
            "江","春","志","天","雨","怡","善","玉","妹","婉","荣","佩","宛",
            "蓉","奕","佳","逢","枫","新","凤","红","娥","莉","娅","娅","欣",
            "雅","悦","艾","云","家","昭","昱","钊","英","昌","婧","婧","婧",
            "婧","婧","查","雯"};
    String[] thirdNameListMen = {
            "诚","沁","辉","森","音","瑜","哲","逸","达","姿",
            "博","萱","宽","辛","荷","林","风","蕊","新","林",
            "彤","岳","斌","兰","杰","翰","珠","骞","德","林",
            "耕","熠","林","坡","锋","峰","庆","池","海","雷",
            "毅","湖","林","君","锋","楠","林","义","方","林",
            "航","晓","超","纯","林","娴","然","昕","琨","兰",
            "鸣","泽","鸳","汁","男","修","汗","博","函","旺",
            "峰","含","贵","杰","林","羽","骏","东","昂","杰",
            "仪","潮","依","书","书","炽","珊","薇","生","伟",
            "峻","昆","峻","朦","晟","峻","凡","蹊","彗","仔",
    };
    String[] thirdNameListWomen = {
            "丽","颖","洁","莉","艳","琳","瑶","馨","龄","琼","倩","芳","花",
            "雪","瑶","瑶","瑶","瑶","丽","蓉","瑶","瑶","蓉","冉","婷","丽",
            "红","英","英","玲","杰","霞","萍","娅","美","辛","悦","珠","凤",
            "红","美","美","文","莉","琦","琪","婷","倩","玲","玲","怡","秀",
            "莹","颖","雪","颖","涵","琳","林","娅","艳","娟","美","梅","怡",
            "春","娅","妹","丽","芳","玲","芬","仙","颖","悦","琳","琳","萍",
            "颖","娥","娜","煜","愉","娅","倩","晴","琳","琳","琴","莹","莹",
            "英","英","洋","澜","旎","旖","漪","英","丽"};
    String[] telephoneHeard={"133","155","152","172","182","185","150","151","152","153","155","156","157","158","159","130","131","132","133","134","135","136","137","138","139","180","182","185","186","187","188"};

    public String[] getFirstNameList() {
        return this.firstNameList;
    }

    public String[] getSecondNameListMen() {
        return this.secondNameListMen;
    }

    public String[] getSecondNameListWomen() {
        return this.secondNameListWomen;
    }

    public String[] getThirdNameListMen() {
        return this.thirdNameListMen;
    }

    public String[] getThirdNameListWomen() {
        return this.thirdNameListWomen;
    }
}
